Tungtangson19092003/TTKT/rl78l1a_smart_blood_pressure_monitor_software/rl78l1a_smart_blood_pressure_monitor_software/Platform/include/iodefine.h
#define COMPOCR_bit    (*(volatile __near __bitf_T *)0x342)
#define C0IE           (((volatile __near __bitf_T *)0x342)->no0)
#define C0OE           (((volatile __near __bitf_T *)0x342)->no1)
#define C0OP           (((volatile __near __bitf_T *)0x342)->no2)
#define SPDMD          (((volatile __near __bitf_T *)0x342)->no7)
#define AMPMC          (*(volatile __near unsigned char  *)0x348)
#define AMPMC_bit      (*(volatile __near __bitf_T *)0x348)
#define AMPSPH         (((volatile __near __bitf_T *)0x348)->no6)
#define AMPSP          (((volatile __near __bitf_T *)0x348)->no7)
#define AMPTRM         (*(volatile __near unsigned char  *)0x349)
#define AMPTRM_bit     (*(volatile __near __bitf_T *)0x349)
#define AMPTRS         (*(volatile __near unsigned char  *)0x34A)
#define AMPTRS_bit     (*(volatile __near __bitf_T *)0x34A)
#define AMPC           (*(volatile __near unsigned char  *)0x34B)
#define AMPC_bit       (*(volatile __near __bitf_T *)0x34B)
#define AMPE0          (((volatile __near __bitf_T *)0x34B)->no0)
#define AMPE1          (((volatile __near __bitf_T *)0x34B)->no1)
#define AMPE2          (((volatile __near __bitf_T *)0x34B)->no2)
#define IREFHE         (((volatile __near __bitf_T *)0x34B)->no6)
#define IREFE          (((volatile __near __bitf_T *)0x34B)->no7)
#define AMPMON         (*(volatile __near unsigned char  *)0x34C)
#define AMPMON_bit     (*(volatile __near __bitf_T *)0x34C)
#define TRTCMP0        (*(volatile __near unsigned short *)0x350)
#define TRTCMP00       (*(volatile __near unsigned char  *)0x350)
#define TRTCMP01       (*(volatile __near unsigned char  *)0x351)
#define TRTCR0         (*(volatile __near unsigned char  *)0x352)
#define TRTCR0_bit     (*(volatile __near __bitf_T *)0x352)
#define TSTART00       (((volatile __near __bitf_T *)0x352)->no0)
#define TSTART01       (((volatile __near __bitf_T *)0x352)->no2)
#define TRTMD0         (*(volatile __near unsigned char  *)0x353)
#define SEG0           (*(volatile __near unsigned char  *)0x400)
#define SEG1           (*(volatile __near unsigned char  *)0x401)
#define SEG2           (*(volatile __near unsigned char  *)0x402)
#define SEG3           (*(volatile __near unsigned char  *)0x403)
#define SEG4           (*(volatile __near unsigned char  *)0x404)
#define SEG5           (*(volatile __near unsigned char  *)0x405)
#define SEG6           (*(volatile __near unsigned char  *)0x406)
#define SEG7           (*(volatile __near unsigned char  *)0x407)
#define SEG8           (*(volatile __near unsigned char  *)0x408)
#define SEG9           (*(volatile __near unsigned char  *)0x409)
#define SEG10          (*(volatile __near unsigned char  *)0x40A)
#define SEG11          (*(volatile __near unsigned char  *)0x40B)
#define SEG12          (*(volatile __near unsigned char  *)0x40C)
#define SEG13          (*(volatile __near unsigned char  *)0x40D)
#define SEG14          (*(volatile __near unsigned char  *)0x40E)
#define SEG15          (*(volatile __near unsigned char  *)0x40F)
#define SEG16          (*(volatile __near unsigned char  *)0x410)
#define SEG17          (*(volatile __near unsigned char  *)0x411)
#define SEG18          (*(volatile __near unsigned char  *)0x412)
#define SEG19          (*(volatile __near unsigned char  *)0x413)
#define SEG20          (*(volatile __near unsigned char  *)0x414)
#define SEG21          (*(volatile __near unsigned char  *)0x415)
#define SEG22          (*(volatile __near unsigned char  *)0x416)
#define SEG23          (*(volatile __near unsigned char  *)0x417)
#define SEG24          (*(volatile __near unsigned char  *)0x418)
#define SEG25          (*(volatile __near unsigned char  *)0x419)
#define SEG26          (*(volatile __near unsigned char  *)0x41A)
#define SEG27          (*(volatile __near unsigned char  *)0x41B)
#define SEG28          (*(volatile __near unsigned char  *)0x41C)
#define SEG29          (*(volatile __near unsigned char  *)0x41D)
#define SEG30          (*(volatile __near unsigned char  *)0x41E)
#define SEG31          (*(volatile __near unsigned char  *)0x41F)
#define SEG32          (*(volatile __near unsigned char  *)0x420)
#define SEG33          (*(volatile __near unsigned char  *)0x421)
#define SEG34          (*(volatile __near unsigned char  *)0x422)
#define SEG35          (*(volatile __near unsigned char  *)0x423)
#define SEG36          (*(volatile __near unsigned char  *)0x424)
#define SEG37          (*(volatile __near unsigned char  *)0x425)
#define SEG38          (*(volatile __near unsigned char  *)0x426)
#define SEG39          (*(volatile __near unsigned char  *)0x427)
#define SEG40          (*(volatile __near unsigned char  *)0x428)
#define SEG41          (*(volatile __near unsigned char  *)0x429)
#define SEG42          (*(volatile __near unsigned char  *)0x42A)
#define SEG43          (*(volatile __near unsigned char  *)0x42B)
#define SEG44          (*(volatile __near unsigned char  *)0x42C)
#define TRT0           (*(volatile __near unsigned short *)0x500)
#define TRT00          (*(volatile __near unsigned char  *)0x500)
#define TRT01          (*(volatile __near unsigned char  *)0x501)
#define ADCSR          (*(volatile __near unsigned short *)0x600)
#define ADANSA0        (*(volatile __near unsigned short *)0x604)
#define ADADS0         (*(volatile __near unsigned short *)0x608)
#define ADADC          (*(volatile __near unsigned char  *)0x60C)
#define ADADC_bit      (*(volatile __near __bitf_T *)0x60C)
#define AVEE           (((volatile __near __bitf_T *)0x60C)->no7)
#define ADCER          (*(volatile __near unsigned short *)0x60E)
#define ADSTRGR        (*(volatile __near unsigned short *)0x610)
#define ADEXICR        (*(volatile __near unsigned short *)0x612)
#define ADTSDR         (*(volatile __near unsigned short *)0x61A)
#define ADOCDR         (*(volatile __near unsigned short *)0x61C)
#define ADRD           (*(volatile __near unsigned short *)0x61E)
#define ADDR0          (*(volatile __near unsigned short *)0x620)
#define ADDR1          (*(volatile __near unsigned short *)0x622)
#define ADDR2          (*(volatile __near unsigned short *)0x624)
#define ADDR3          (*(volatile __near unsigned short *)0x626)
#define ADDR4          (*(volatile __near unsigned short *)0x628)
#define ADDR5          (*(volatile __near unsigned short *)0x62A)
#define ADDR6          (*(volatile __near unsigned short *)0x62C)
#define ADDR7          (*(volatile __near unsigned short *)0x62E)
#define ADDR8          (*(volatile __near unsigned short *)0x630)
#define ADDR9          (*(volatile __near unsigned short *)0x632)
#define ADDR10         (*(volatile __near unsigned short *)0x634)
#define ADDR11         (*(volatile __near unsigned short *)0x636)
#define ADDR12         (*(volatile __near unsigned short *)0x638)
#define ADDR13         (*(volatile __near unsigned short *)0x63A)
#define ADDR14         (*(volatile __near unsigned short *)0x63C)
#define ADHVREFCNT     (*(volatile __near unsigned char  *)0x68A)
#define ADHVREFCNT_bit (*(volatile __near __bitf_T *)0x68A)
#define ADSLP          (((volatile __near __bitf_T *)0x68A)->no7)
#define ADSSTRT        (*(volatile __near unsigned char  *)0x6DE)
#define ADSSTRO        (*(volatile __near unsigned char  *)0x6DF)
#define ADSSTR0        (*(volatile __near unsigned char  *)0x6E0)
#define ADSSTR1        (*(volatile __near unsigned char  *)0x6E1)
#define ADSSTR2        (*(volatile __near unsigned char  *)0x6E2)
#define ADSSTR3        (*(volatile __near unsigned char  *)0x6E3)
#define ADSSTR4        (*(volatile __near unsigned char  *)0x6E4)
#define ADSSTR5        (*(volatile __near unsigned char  *)0x6E5)
#define ADSSTR6        (*(volatile __near unsigned char  *)0x6E6)
#define ADSSTR7        (*(volatile __near unsigned char  *)0x6E7)
#define ADSSTR8        (*(volatile __near unsigned char  *)0x6E8)
#define ADSSTR9        (*(volatile __near unsigned char  *)0x6E9)
#define ADSSTR10       (*(volatile __near unsigned char  *)0x6EA)
#define ADSSTR11       (*(volatile __near unsigned char  *)0x6EB)
#define ADSSTR12       (*(volatile __near unsigned char  *)0x6EC)
#define ADSSTR13       (*(volatile __near unsigned char  *)0x6ED)
#define ADSSTR14       (*(volatile __near unsigned char  *)0x6EE)
#define P0             (*(volatile __near unsigned char  *)0xFF00)
#define P0_bit         (*(volatile __near __bitf_T *)0xFF00)
#define P1             (*(volatile __near unsigned char  *)0xFF01)
#define P1_bit         (*(volatile __near __bitf_T *)0xFF01)
#define P2             (*(volatile __near unsigned char  *)0xFF02)
#define P2_bit         (*(volatile __near __bitf_T *)0xFF02)
#define P3             (*(volatile __near unsigned char  *)0xFF03)
#define P3_bit         (*(volatile __near __bitf_T *)0xFF03)
#define P4             (*(volatile __near unsigned char  *)0xFF04)
#define P4_bit         (*(volatile __near __bitf_T *)0xFF04)
#define P5             (*(volatile __near unsigned char  *)0xFF05)
#define P5_bit         (*(volatile __near __bitf_T *)0xFF05)
#define P6             (*(volatile __near unsigned char  *)0xFF06)
#define P6_bit         (*(volatile __near __bitf_T *)0xFF06)
#define P7             (*(volatile __near unsigned char  *)0xFF07)
#define P7_bit         (*(volatile __near __bitf_T *)0xFF07)
#define P8             (*(volatile __near unsigned char  *)0xFF08)
#define P8_bit         (*(volatile __near __bitf_T *)0xFF08)
#define P10            (*(volatile __near unsigned char  *)0xFF0A)
#define P10_bit        (*(volatile __near __bitf_T *)0xFF0A)
#define P12            (*(volatile __near unsigned char  *)0xFF0C)
#define P12_bit        (*(volatile __near __bitf_T *)0xFF0C)
#define P13            (*(volatile __near unsigned char  *)0xFF0D)
#define P13_bit        (*(volatile __near __bitf_T *)0xFF0D)
#define P14            (*(volatile __near unsigned char  *)0xFF0E)
#define P14_bit        (*(volatile __near __bitf_T *)0xFF0E)
#define P15            (*(volatile __near unsigned char  *)0xFF0F)
#define P15_bit        (*(volatile __near __bitf_T *)0xFF0F)
#define SDR00          (*(volatile __near unsigned short *)0xFF10)
#define SIO00          (*(volatile __near unsigned char  *)0xFF10)
#define TXD0           (*(volatile __near unsigned char  *)0xFF10)
#define SDR01          (*(volatile __near unsigned short *)0xFF12)
#define RXD0           (*(volatile __near unsigned char  *)0xFF12)
#define SDR12          (*(volatile __near unsigned short *)0xFF14)
#define SIO30          (*(volatile __near unsigned char  *)0xFF14)
#define TXD3           (*(volatile __near unsigned char  *)0xFF14)
#define SDR13          (*(volatile __near unsigned short *)0xFF16)
#define RXD3           (*(volatile __near unsigned char  *)0xFF16)
#define TDR00          (*(volatile __near unsigned short *)0xFF18)
#define TDR01          (*(volatile __near unsigned short *)0xFF1A)
#define TDR01L         (*(volatile __near unsigned char  *)0xFF1A)
#define TDR01H         (*(volatile __near unsigned char  *)0xFF1B)
#define PM0            (*(volatile __near unsigned char  *)0xFF20)
#define PM0_bit        (*(volatile __near __bitf_T *)0xFF20)
#define PM1            (*(volatile __near unsigned char  *)0xFF21)
#define PM1_bit        (*(volatile __near __bitf_T *)0xFF21)
#define PM2            (*(volatile __near unsigned char  *)0xFF22)
#define PM2_bit        (*(volatile __near __bitf_T *)0xFF22)
#define PM3            (*(volatile __near unsigned char  *)0xFF23)
#define PM3_bit        (*(volatile __near __bitf_T *)0xFF23)
#define PM4            (*(volatile __near unsigned char  *)0xFF24)
#define PM4_bit        (*(volatile __near __bitf_T *)0xFF24)
#define PM5            (*(volatile __near unsigned char  *)0xFF25)
#define PM5_bit        (*(volatile __near __bitf_T *)0xFF25)
#define PM6            (*(volatile __near unsigned char  *)0xFF26)
#define PM6_bit        (*(volatile __near __bitf_T *)0xFF26)
#define PM7            (*(volatile __near unsigned char  *)0xFF27)
#define PM7_bit        (*(volatile __near __bitf_T *)0xFF27)
#define PM8            (*(volatile __near unsigned char  *)0xFF28)
#define PM8_bit        (*(volatile __near __bitf_T *)0xFF28)
#define PM10           (*(volatile __near unsigned char  *)0xFF2A)
#define PM10_bit       (*(volatile __near __bitf_T *)0xFF2A)
#define PM12           (*(volatile __near unsigned char  *)0xFF2C)
#define PM12_bit       (*(volatile __near __bitf_T *)0xFF2C)
#define PM14           (*(volatile __near unsigned char  *)0xFF2E)
#define PM14_bit       (*(volatile __near __bitf_T *)0xFF2E)
#define PM15           (*(volatile __near unsigned char  *)0xFF2F)
#define PM15_bit       (*(volatile __near __bitf_T *)0xFF2F)
#define KRCTL          (*(volatile __near unsigned char  *)0xFF34)
#define KRCTL_bit      (*(volatile __near __bitf_T *)0xFF34)
#define KRF            (*(volatile __near unsigned char  *)0xFF35)
#define KRM0           (*(volatile __near unsigned char  *)0xFF37)
#define KRM0_bit       (*(volatile __near __bitf_T *)0xFF37)
#define EGP0           (*(volatile __near unsigned char  *)0xFF38)
#define EGP0_bit       (*(volatile __near __bitf_T *)0xFF38)
#define EGN0           (*(volatile __near unsigned char  *)0xFF39)
#define EGN0_bit       (*(volatile __near __bitf_T *)0xFF39)
#define LCDM0          (*(volatile __near unsigned char  *)0xFF40)
#define LCDM1          (*(volatile __near unsigned char  *)0xFF41)
#define LCDM1_bit      (*(volatile __near __bitf_T *)0xFF41)
#define LCDVLM         (((volatile __near __bitf_T *)0xFF41)->no0)
#define LCDSEL         (((volatile __near __bitf_T *)0xFF41)->no3)
#define BLON           (((volatile __near __bitf_T *)0xFF41)->no4)
#define VLCON          (((volatile __near __bitf_T *)0xFF41)->no5)
#define SCOC           (((volatile __near __bitf_T *)0xFF41)->no6)
#define LCDON          (((volatile __near __bitf_T *)0xFF41)->no7)
#define LCDC0          (*(volatile __near unsigned char  *)0xFF42)
#define VLCD           (*(volatile __near unsigned char  *)0xFF43)
#define SDR02          (*(volatile __near unsigned short *)0xFF44)
#define SIO10          (*(volatile __near unsigned char  *)0xFF44)
#define TXD1           (*(volatile __near unsigned char  *)0xFF44)
#define SDR03          (*(volatile __near unsigned short *)0xFF46)
#define RXD1           (*(volatile __near unsigned char  *)0xFF46)
#define SDR10          (*(volatile __near unsigned short *)0xFF48)
#define SIO20          (*(volatile __near unsigned char  *)0xFF48)
#define TXD2           (*(volatile __near unsigned char  *)0xFF48)
#define SDR11          (*(volatile __near unsigned short *)0xFF4A)
#define RXD2           (*(volatile __near unsigned char  *)0xFF4A)
#define IICA0          (*(volatile __near unsigned char  *)0xFF50)
#define IICS0          (*(volatile __near unsigned char  *)0xFF51)
#define IICS0_bit      (*(volatile __near __bitf_T *)0xFF51)
#define SPD0           (((volatile __near __bitf_T *)0xFF51)->no0)
#define STD0           (((volatile __near __bitf_T *)0xFF51)->no1)
#define ACKD0          (((volatile __near __bitf_T *)0xFF51)->no2)
#define TRC0           (((volatile __near __bitf_T *)0xFF51)->no3)
#define COI0           (((volatile __near __bitf_T *)0xFF51)->no4)
#define EXC0           (((volatile __near __bitf_T *)0xFF51)->no5)
#define ALD0           (((volatile __near __bitf_T *)0xFF51)->no6)
#define MSTS0          (((volatile __near __bitf_T *)0xFF51)->no7)
#define IICF0          (*(volatile __near unsigned char  *)0xFF52)
#define IICF0_bit      (*(volatile __near __bitf_T *)0xFF52)
#define IICRSV0        (((volatile __near __bitf_T *)0xFF52)->no0)
#define STCEN0         (((volatile __near __bitf_T *)0xFF52)->no1)
#define IICBSY0        (((volatile __near __bitf_T *)0xFF52)->no6)
#define STCF0          (((volatile __near __bitf_T *)0xFF52)->no7)
#define TDR02          (*(volatile __near unsigned short *)0xFF64)
#define TDR03          (*(volatile __near unsigned short *)0xFF66)
#define TDR03L         (*(volatile __near unsigned char  *)0xFF66)
#define TDR03H         (*(volatile __near unsigned char  *)0xFF67)
#define TDR04          (*(volatile __near unsigned short *)0xFF68)
#define TDR05          (*(volatile __near unsigned short *)0xFF6A)
#define TDR06          (*(volatile __near unsigned short *)0xFF6C)
#define TDR07          (*(volatile __near unsigned short *)0xFF6E)
#define DADR0          (*(volatile __near unsigned short *)0xFF70)
#define DADR1          (*(volatile __near unsigned short *)0xFF72)
#define DACR           (*(volatile __near unsigned char  *)0xFF74)
#define DADPR          (*(volatile __near unsigned char  *)0xFF75)
#define DAADSCR        (*(volatile __near unsigned char  *)0xFF76)
#define DAVREFCR       (*(volatile __near unsigned char  *)0xFF77)
#define ITMC           (*(volatile __near unsigned short *)0xFF90)
#define SEC            (*(volatile __near unsigned char  *)0xFF92)
#define MIN            (*(volatile __near unsigned char  *)0xFF93)
#define HOUR           (*(volatile __near unsigned char  *)0xFF94)
#define WEEK           (*(volatile __near unsigned char  *)0xFF95)
#define DAY            (*(volatile __near unsigned char  *)0xFF96)
#define MONTH          (*(volatile __near unsigned char  *)0xFF97)
#define YEAR           (*(volatile __near unsigned char  *)0xFF98)
#define ALARMWM        (*(volatile __near unsigned char  *)0xFF9A)
#define ALARMWH        (*(volatile __near unsigned char  *)0xFF9B)
#define ALARMWW        (*(volatile __near unsigned char  *)0xFF9C)
#define RTCC0          (*(volatile __near unsigned char  *)0xFF9D)
#define RTCC0_bit      (*(volatile __near __bitf_T *)0xFF9D)
#define RCLOE1         (((volatile __near __bitf_T *)0xFF9D)->no5)
#define RTCE           (((volatile __near __bitf_T *)0xFF9D)->no7)
#define RTCC1          (*(volatile __near unsigned char  *)0xFF9E)
#define RTCC1_bit      (*(volatile __near __bitf_T *)0xFF9E)
#define RWAIT          (((volatile __near __bitf_T *)0xFF9E)->no0)
#define RWST           (((volatile __near __bitf_T *)0xFF9E)->no1)
#define RIFG           (((volatile __near __bitf_T *)0xFF9E)->no3)
#define WAFG           (((volatile __near __bitf_T *)0xFF9E)->no4)
#define RITE           (((volatile __near __bitf_T *)0xFF9E)->no5)
#define WALIE          (((volatile __near __bitf_T *)0xFF9E)->no6)
#define WALE           (((volatile __near __bitf_T *)0xFF9E)->no7)
#define CMC            (*(volatile __near unsigned char  *)0xFFA0)
#define CSC            (*(volatile __near unsigned char  *)0xFFA1)
#define CSC_bit        (*(volatile __near __bitf_T *)0xFFA1)
#define HIOSTOP        (((volatile __near __bitf_T *)0xFFA1)->no0)
#define XTSTOP         (((volatile __near __bitf_T *)0xFFA1)->no6)
#define MSTOP          (((volatile __near __bitf_T *)0xFFA1)->no7)
#define OSTC           (*(volatile __near unsigned char  *)0xFFA2)
#define OSTC_bit       (*(volatile __near __bitf_T *)0xFFA2)
#define OSTS           (*(volatile __near unsigned char  *)0xFFA3)
#define CKC            (*(volatile __near unsigned char  *)0xFFA4)
#define CKC_bit        (*(volatile __near __bitf_T *)0xFFA4)
#define MCM0           (((volatile __near __bitf_T *)0xFFA4)->no4)
#define MCS            (((volatile __near __bitf_T *)0xFFA4)->no5)
#define CSS            (((volatile __near __bitf_T *)0xFFA4)->no6)
#define CLS            (((volatile __near __bitf_T *)0xFFA4)->no7)
#define CKS0           (*(volatile __near unsigned char  *)0xFFA5)
#define CKS0_bit       (*(volatile __near __bitf_T *)0xFFA5)
#define PCLOE0         (((volatile __near __bitf_T *)0xFFA5)->no7)
#define CKS1           (*(volatile __near unsigned char  *)0xFFA6)
#define CKS1_bit       (*(volatile __near __bitf_T *)0xFFA6)
#define PCLOE1         (((volatile __near __bitf_T *)0xFFA6)->no7)
#define RESF           (*(volatile __near unsigned char  *)0xFFA8)
#define LVIM           (*(volatile __near unsigned char  *)0xFFA9)
#define LVIM_bit       (*(volatile __near __bitf_T *)0xFFA9)
#define LVIF           (((volatile __near __bitf_T *)0xFFA9)->no0)
#define LVIOMSK        (((volatile __near __bitf_T *)0xFFA9)->no1)
#define LVISEN         (((volatile __near __bitf_T *)0xFFA9)->no7)
#define LVIS           (*(volatile __near unsigned char  *)0xFFAA)
#define LVIS_bit       (*(volatile __near __bitf_T *)0xFFAA)
#define LVILV          (((volatile __near __bitf_T *)0xFFAA)->no0)
#define LVIMD          (((volatile __near __bitf_T *)0xFFAA)->no7)
#define WDTE           (*(volatile __near unsigned char  *)0xFFAB)
#define CRCIN          (*(volatile __near unsigned char  *)0xFFAC)
#define IF2            (*(volatile __near unsigned short *)0xFFD0)
#define IF2L           (*(volatile __near unsigned char  *)0xFFD0)
#define IF2L_bit       (*(volatile __near __bitf_T *)0xFFD0)
#define IF2H           (*(volatile __near unsigned char  *)0xFFD1)
#define IF2H_bit       (*(volatile __near __bitf_T *)0xFFD1)
#define SREIF3         (((volatile __near __bitf_T *)0xFFD0)->no0)
#define TMIF04         (((volatile __near __bitf_T *)0xFFD0)->no1)
#define TMIF05         (((volatile __near __bitf_T *)0xFFD0)->no2)
#define PIF6           (((volatile __near __bitf_T *)0xFFD0)->no3)
#define PIF7           (((volatile __near __bitf_T *)0xFFD0)->no4)
#define CMPIF0         (((volatile __near __bitf_T *)0xFFD0)->no6)
#define TMIF06         (((volatile __near __bitf_T *)0xFFD1)->no0)
#define TMIF07         (((volatile __near __bitf_T *)0xFFD1)->no1)
#define ITIF00         (((volatile __near __bitf_T *)0xFFD1)->no2)
#define ITIF01         (((volatile __near __bitf_T *)0xFFD1)->no3)
#define FLIF           (((volatile __near __bitf_T *)0xFFD1)->no7)
#define MK2            (*(volatile __near unsigned short *)0xFFD4)
#define MK2L           (*(volatile __near unsigned char  *)0xFFD4)
#define MK2L_bit       (*(volatile __near __bitf_T *)0xFFD4)
#define MK2H           (*(volatile __near unsigned char  *)0xFFD5)
#define MK2H_bit       (*(volatile __near __bitf_T *)0xFFD5)
#define SREMK3         (((volatile __near __bitf_T *)0xFFD4)->no0)
#define TMMK04         (((volatile __near __bitf_T *)0xFFD4)->no1)
#define TMMK05         (((volatile __near __bitf_T *)0xFFD4)->no2)
#define PMK6           (((volatile __near __bitf_T *)0xFFD4)->no3)
#define PMK7           (((volatile __near __bitf_T *)0xFFD4)->no4)
#define CMPMK0         (((volatile __near __bitf_T *)0xFFD4)->no6)
#define TMMK06         (((volatile __near __bitf_T *)0xFFD5)->no0)
#define TMMK07         (((volatile __near __bitf_T *)0xFFD5)->no1)
#define ITMK00         (((volatile __near __bitf_T *)0xFFD5)->no2)
#define ITMK01         (((volatile __near __bitf_T *)0xFFD5)->no3)
#define FLMK           (((volatile __near __bitf_T *)0xFFD5)->no7)
#define PR02           (*(volatile __near unsigned short *)0xFFD8)
#define PR02L          (*(volatile __near unsigned char  *)0xFFD8)
#define PR02L_bit      (*(volatile __near __bitf_T *)0xFFD8)
#define PR02H          (*(volatile __near unsigned char  *)0xFFD9)
#define PR02H_bit      (*(volatile __near __bitf_T *)0xFFD9)
#define SREPR03        (((volatile __near __bitf_T *)0xFFD8)->no0)
#define TMPR004        (((volatile __near __bitf_T *)0xFFD8)->no1)
#define TMPR005        (((volatile __near __bitf_T *)0xFFD8)->no2)
#define PPR06          (((volatile __near __bitf_T *)0xFFD8)->no3)
#define PPR07          (((volatile __near __bitf_T *)0xFFD8)->no4)
#define CMPPR00        (((volatile __near __bitf_T *)0xFFD8)->no6)
#define TMPR006        (((volatile __near __bitf_T *)0xFFD9)->no0)
#define TMPR007        (((volatile __near __bitf_T *)0xFFD9)->no1)
#define ITPR000        (((volatile __near __bitf_T *)0xFFD9)->no2)
#define ITPR001        (((volatile __near __bitf_T *)0xFFD9)->no3)
#define FLPR0          (((volatile __near __bitf_T *)0xFFD9)->no7)
#define PR12           (*(volatile __near unsigned short *)0xFFDC)
#define PR12L          (*(volatile __near unsigned char  *)0xFFDC)
#define PR12L_bit      (*(volatile __near __bitf_T *)0xFFDC)
#define PR12H          (*(volatile __near unsigned char  *)0xFFDD)
#define PR12H_bit      (*(volatile __near __bitf_T *)0xFFDD)
#define SREPR13        (((volatile __near __bitf_T *)0xFFDC)->no0)
